#pragma once
#include "Stage.h"

//todo ステージのA敵配置情報
ENEMY_info s_stageAEnemy[][ENEMY_INFO_STRUCT] =
{
	//マップパターン0
	{
		{450.0f,200.0f,0},
		{ 10000,0,100 }
	},
	//マップパターン1
	{
		{450.0f,300.0f,0},
		{ 10000,0,100}
	},
	//マップパターン2
	{
		{450.0f,500.0f,0},
		{ 10000,0,100}
	},
	//マップパターン3
	{
		{ 10000,0,100}
	},
	//マップパターン4
	{
		{450.0f,500.0f,0},
		{ 10000,0,100}
	},
	//マップパターン5
	{
		{ 10000,0,100}
	},
	//マップパターン6
	{
		{ 10000,0,100}
	},
	//マップパターン7
	{
		{ 10000,0,100}
	},
	//マップパターン8
	{
		{ 10000,0,100}
	},
	//マップパターン9
	{
		{ 10000,0,100}
	},
	//マップパターン10
	{
		{ 10000,0,100}
	},
	//マップパターン11
	{
		{ 10000,0,100}
	},
	//マップパターン12
	{
		{ 10000,0,100}
	},
	//マップパターン13
	{
		{ 10000,0,100}
	},
	//マップパターン14
	{
		{ 10000,0,100}
	},
	//マップパターン15
	{
		{ 10000,0,100}
	},
	//マップパターン16
	{
		{ 10000,0,100}
	},
	//マップパターン17
	{
		{ 10000,0,100}
	},
	//マップパターン18
	{
		{ 10000,0,100}
	},
	//マップパターン19
	{
		{ 10000,0,100}
	},
	//マップパターン20
	{
		{ 10000,0,100}
	},

};